#include<stdio.h>

int main()

{

	int v[5],max[5],min[5],i,j,s=0;

	int a[10][5]={{90,75,80,90,62},

	              {79,78,75,90,99},

	              {60,78,77,98,86},

                  {55,67,89,98,87},

	              {78,74,73,77,78},

	              {78,99,77,65,85},

           	      {67,78,88,98,78},

	              {66,77,65,77,54},

	              {54,67,88,53,63},

          	      {67,89,99,77,67}};

	for(i=0;i<5;i++)

	{

		for(j=0;j<10;j++)

		s+=a[j][i];

		v[i]=s/10;

		s=0;

	}

     

	for(i=0;i<5;i++)

	{

		max[i]=a[0][i];min[i]=a[0][i];

		for(j=0;j<10;j++) 

	    if(a[j][i]>max[i])

	    {max[i]=a[j][i];} 


	    if(a[j][i]<min[i])

	    {min[i]=a[j][i];}
		}

	}
}

	printf("数学\n平均分：%d\n最高分：%d\n最低分：%d\n",v[0],max[0],min[0]) ;

	printf("化学\n平均分：%d\n最高分：%d\n最低分：%d\n",v[1],max[1],min[1]) ;

	printf("语文\n平均分：%d\n最高分：%d\n最低分：%d\n",v[2],max[2],min[2]) ;

	printf("英语\n平均分：%d\n最高分：%d\n最低分：%d\n",v[3],max[3],min[3]) ;

	printf("物理\n平均分：%d\n最高分：%d\n最低分：%d\n",v[4],max[4],min[4]) ;

}
